[
    "Adam is the first scripted transgender teen character in television history, not including documentaries or one-time guest roles.",
    "J.T.'s full name, 'James Tiberius,' is a reference to Captain James Tiberius Kirk from Star Trek: The Original Series (1966).",
    "Every girl romantically linked to J.T. Yorke had been pregnant at some point: Manny terminated her pregnancy with Craig's child, Liberty gave up her and J.T.'s son for adoption, and Mia had a daughter from a previous relationship.",
    "During season two, Terri MacGregor becomes a successful plus size model. In real life, the actress who plays Terri, Christina Schmidt, left the show to become a real life plus size model. She is represented by B&M Models in Toronto and has been featured in Italian Vogue, as well as ads for Torrid, MXM, and Nygard.",
    "With several exceptions in the first season, the episodes of Degrassi: The Next Generation are named after 1980s songs.",
    "In the episode 'Take My Breath Away' (2x10), Craig and Manny go on their first date. Later, while Craig is talking to Jimmy and Spinner, he says that Manny kept reminding him of his little sister, Angie. In fact, Cassie Steele (Manny) and Alex Steele (Angie) are sisters in real life.",
    "Alex Steele, who played Angela Jeremiah during seasons 1-5, returned for season 11 to play a new character, Tori Santamaria.",
    "All of the piercings that Spinner (Shane Kippel) displays throughout the show are real. Kippel asked permission from the producers before each piercing, especially his tongue stud, which is most noticeable in seasons 3 and 4. He was allowed to keep the piercing after proving it did not affect his speech. While Kippel's piercings were real, all of the piercings Stacey Farber sported while playing the role of Ellie Nash were fake.",
    "The character 'Emma Nelson' was named after the Emmy Award-winning episode of Degrassi Junior High where Spike tells her mom that she is pregnant.",
    "Peter Stone (Jamie Johnston) was originally supposed to come out as bisexual, but the writers decided against it.",
    "Spinner has had the most girlfriends of any male character throughout the entire show.",
    "Shane Kippel lost over 50 pounds after the first season in 2001. Kippel stated that seeing himself as Spinner Mason on television embarrassed him and motivated him to lose weight for future seasons. As a result, Spinner went from being just the basketball manager to actually becoming an athlete. Spinner went on to play soccer, field hockey, and basketball.",
    "Sean Cameron was the first Degrassi character to enlist in the Army. He was also the second character to go to prison after Wheels (Neil Hope).",
    "Alli Bhandari has had more relationships than any other female character in Degrassi history.",
    "Charlotte Arnold auditioned for a total of four Degrassi roles before landing the role of Holly J Sinclair; she originally auditioned for the roles of Manny and Emma, a character who never made it into season four, and Anya.",
    "Emma Nelson was the first character to develop Post-Traumatic Stress Disorder (PTSD). Emma developed the disorder after having a gun pointed at her during the Degrassi shooting in season four.",
    "Terri MacGregor was the first character to mention the infamous unseen character Heather Sinclair.",
    "Mr. Simpson is the only character to be a regular throughout every season of Degrassi, including Degrassi Junior High.",
    "Similar to his character, Marco Del Rossi, Adamo Ruggiero came out as gay in 2008, five years after his character came out on the show.",
    "Just like Paige and Marco in the show, Lauren Collins and Adamo Ruggiero are very close friends and are seen together frequently.",
    "Toby Isaacs, Jimmy Brooks, and Terri McGreggor were the only original characters to never have sex during the course of the show. Emma, Manny, Liberty, J.T., Ashley, Craig, Sean, Hazel, Spinner, Paige, and Ellie all lost their virginity at some point throughout the show. Toby dated Spinner's sister, Kendra, but the relationship ended before intimacy, as did Terri's abusive relationship with Rick, and Jimmy tried to have sex with Ashley but ended up failing.",
    "Both times Paige broke her leg was indirectly caused by Manny Santos.",
    "Cassie Steele is the youngest regular to join the series at age 11.",
    "Daniel Clark is the only original cast member who was not born in Canada.",
    "Drake has admitted he was high on marijuana during his audition.",
    "Manny Santos was the first Degrassi student of the new generation to experience a pregnancy.",
    "Adam Torres is the first scripted teenage transgender character in television history.",
    "Two of the three longterm girlfriends of Peter's never graduated from Degrassi, because the actresses, Shenae Grimes and Nina Dobrev, left the show to star in their own CW television series, 90210 and The Vampire Diaries.",
    "Manny, Liberty, and Emma have all lost their virginity to their first love interests on the show; Manny to Craig, Liberty to JT, and Emma to Sean.",
    "Despite several friends knowing about the incident, the only one who accompanied Paige to her rape trial was Spinner.",
    "Daniel Clark left acting altogether after wrapping up his character, Sean Cameron, in 2008. He went on to major in Political Communications at New York University where he worked as a digital news associate for ABC News. He is an anchor and associate producer for Fusion in Miami, FL.",
    "Spinner Mason was the first character to use medical marijuana.",
    "Spinner's adopted sister, Kendra Mason (played by Katie Lai), was suddenly written out of the show after the end of season 3 in 2004. The last episode in which Lai appeared as Kendra was the season 3 finale titled 'The Power of Love.' After that the character was never seen or mentioned again.",
    "Degrassi was the first show to say the word 'blowjob' on a Viacom owned network.",
    "Kevin Smith wrote his own dialogue for his three episode guest appearance as himself.",
    "Emma was the first character to talk in Degrassi.",
    "Jake Epstein (Craig Manning) was born on January 16, 1987, only two days before the premiere of Degrassi High (1987).",
    "Danny Van Zandt was the first younger sibling of a main character to later become a main character. He was introduced as Liberty's younger brother in season four.",
    "Spinner worked at The Dot Grill from season 3 all the way through season 9, working his way up from a busboy to the manager. Spinner made a cameo in season 14 and revealed himself to still be working at The Dot as he conducted Eli's job interview.",
    "A total of eight characters have been diagnosed with a mental or learning disability: Craig Manning and Eli Goldsworthy are bipolar, Spinner Mason has ADHD, Anya MacPherson and Zoë Rivas have dyslexia, Connor DeLaurier has Asperger's Syndrome, Joey Jeremiah has disgraphia, and Liberty Van Zandt has dyscalculia.",
    "Jimmy and Spinner have both helped each other through issues with their genitals. Spinner confided in Jimmy when he was experiencing uncontrollable erections as well as when he was diagnosed with testicular cancer. Jimmy confided in Spinner when he was experiencing erectile dysfunction as a result of being paralyzed.",
    "Clare has been kissed by more boys than any other female character.",
    "Shane Kippel, Miriam McDonald, and Cassie Steele were the only original student cast members to remain on the show until 2010. The other original student cast members left anywhere from seasons 7 through 9.",
    "As of 2012, five characters have had the Degrassi logo on their backs at the end of the opening theme. The first was Marco Del Rossi from seasons 3 through 7. Second was Jane Vaughn from season 8 to 9. Alli Bhandari starting season 10, Drew Torres in season 11, and lastly, Clare Edwards in season 12.",
    "Although Alex (Deanna Casaluce) was involved with the paint and feathers prank on Rick Murray (Ephraim Ellis), she did not receive the same punishment that Spinner and Jay received. The two boys were ultimately expelled from Degrassi after admitting responsibility for the prank while Alex went on to stay in school, graduate, and become friends with Jimmy who was paralyzed as a result of the prank.",
    "Both Marco Del Rossi and Alli Bhandari have developed addictions to gambling.",
    "Adam was originally meant to be an androgynous lesbian character named Zoe.",
    "Five characters from Degrassi Junior High/Degrassi High have made regular appearances on the show: Snake (now Mr. Simpson), Spike, Joey, Caitlin and Mr. Raditch. Others have made guest appearances or cameos when circumstances have called for it.",
    "After their time on the show, Jake Epstein and Mike Lobel formed a band called 'The Grassi.'",
    "Sean Cameron's nickname throughout season three was 'Slim Shady'",
    "Griffin Pierce-Taylor was the first Degrassi: The Next Generation character to be revealed as HIV positive.",
    "Jordan Todosey had to cut off her long locks and adopt a more masculine gait for the role of Adam.",
    "Peter Stone was the first character to say the word 'bitch.'",
    "Emma, Manny, and Liberty have all been romantically involved with Damian.",
    "Paige was the first bisexual character to be revealed.",
    "Alexa Rose Steele is the only actor in Degrassi history to portray two different characters. She originally debuted as Craig Manning's half-sister, Angela Jeremiah, but she was written out of the show after season 5. She returned in season 11 as a new character, Tori Santamaria.",
    "The last shot of Liberty, Emma, Toby, and Manny as students of Degrassi is of them standing in the J.T. Yorke Memorial Garden, formerly known as the Zen Garden.",
    "Jake Epstein won a Gemini award for Best Performance in a Children's or Youth Television Show in 2003 for his portrayal of Craig Manning.",
    "Deanna Casaluce originally auditioned for the role of Paige Michalchuk before being cast as Alex Nunez in season three.",
    "Ashley Kerwin (Melissa McIntyre) is the only Degrassi character to have a set of same-sex parents. Ashley's father, Robert, married his partner during season four.",
    "A total of ten characters were held back one or more year in school: Sean Cameron, Ashley Kerwin, Jimmy Brooks, Gavin 'Spinner' Mason, Rick Murray, Fiona Coyne, Drew Torres, Tori Santamaria, Mike Dallas, and Imogen Moreno.",
    "Toby was one the first male character to have an eating disorder. Toby developed bulimia while trying to make the Degrassi wrestling team. He was ultimately kicked off of the team by Coach Armstrong.",
    "Dr. Sally, the infamous Degrassi sex lady, was portrayed by well-known Canadian sex educator, Sue Johanson. She appeared twice in Degrassi: The Next Generation as well as in Degrassi High in 1989.",
    "Shane Kippel once said it was awkward as a Jewish man to portray a devout Christian character.",
    "There have been three Internet creepers on Degrassi: 'Jordan' (Emma), 'Adams' (Darcy), and 'Lovequeen16' (Connor).",
    "There have been two characters with Bi-polar disorder: Craig Manning and Eli Goldsworthy.",
    "Darryl Armstrong committed suicide on January 30, 2005 in Toronto. He played Dylan Michalchuk's ex-boyfriend, Tom. He appeared in the season 3 episode, 'It's Raining Men,' less than a year before his death.",
    "Manuella 'Manny' Santos was a first generation Canadian. Marco Del Rossi was also a first generation Canadian as his parents were both Italian.",
    "The start of the feud between Degrassi and Lakehurst began after a fight broke out between the students in the episode, 'Can't Hardly Wait.' It also served as the introduction of Lakehurst transplant, Mia Jones (Nina Dobrev), who started the fight after an ex-boyfriend insulted her at a basketball game.",
    "Adamo Ruggiero originally auditioned for the role of Craig Manning. Ruggiero was ultimately cast as Marco Del Rossi while the role of Craig went to Jake Epstein.",
    "The title of the show was shortened to Degrassi from Degrassi: The Next Generation after the ninth season.",
    "Similar to his character, Gavin 'Spinner' Mason, Shane Kippel is a drummer in real life. Kippel drums in a rock band, Dear Love, in and around Toronto, Canada. He has a presence on Twitter and regularly tweets fans and his former Degrassi cast mates.",
    "Two characters crashed a vehicle after finding out Liberty was pregnant. Toby crashed his remote control car into a trashcan when J.T. told him and J.T. crashed his car into a bus shelter when Liberty told him.",
    "Cassie Steele, who played Manny Santos, is the older sister of Alex Steele, the actress who played Craig Manning's little sister Angela Jeremiah, as well as Tori Santamaria. This made Alex one of the few actors to portray two separate characters on the same show.",
    "A large amount of the original student cast members are Jewish. These actors include Jake Epstein, Stacey Farber, Jake Goldsbie, Aubrey Graham, Lauren Collins, and Shane Kippel.",
    "Hazel was the first character to know that Rick was abusing Terri. Ironically enough, she was the one who convinced Terri to start dating Rick.",
    "The US versions of many earlier episodes were edited to remove a majority of gay slurs, homophobia, sexual innuendos, and sexual activity. Unedited 'director's cuts' of the episodes were aired in Canada and can be seen on the home DVD releases.",
    "Although Spinner Mason went on to graduate from high school after his expulsion from Degrassi, Jay Hogart never completed high school.",
    "Hazel Aden is the only main character revealed to be a practicing Muslim.",
    "The Dot Grill debuted in season three as a new hangout for Degrassi students and members of the local community. Characters who have worked at The Dot include Gavin 'Spinner' Mason, Paige Michalchuk, Jay Hogart, Emma Nelson, Peter Stone, Holly J Sinclair, Mark Fitzgerald, Leo Lauzon, and Eli Goldsworthy.",
    "Paige Michalchuk's main catchphrase is 'hun'",
    "Emma and Manny have both been in relationships with Jay, Spinner, and Damian.",
    "As of 2013, there have been 51 fight scenes. Only thirteen of them ended in a tie, and three of them were going on at once in one episode.",
    "Toby Isaacs' grandparents were killed in the Holocaust.",
    "Sarah Barrable-Tishauer originally auditioned for the role of Manny Santos. The role of Manny ultimately went to Cassie Steele while Barrable-Tishauer was cast as Liberty Van Zandt.",
    "Both parts of 'Accidents Will Happen' were not aired in the United States prior to 2006. US based channel, The N, premiered the episode during an 'every episode ever' marathon of Degrassi before the premiere of the sixth season despite the episodes originally airing in Canada in 2004.",
    "Most of the popular kids referred to Emma as 'Cause-girl' due to the fact that she was always protesting something. Paige stopped referring to Emma as the nickname after they joined forces to protest Rick Murray returning to Degrassi after abusing their friend, Terri.",
    "Liberty was the only Degrassi student council member to remain president for two years in a row.",
    "Connor DeLaurier wore the same outfit throughout season 8.",
    "Travis Donegan was fired for showing up late too many times. As a result, his character Towerz was written out of the show after just one season.",
    "Kevin Smith had a childhood crush on Caitlin Ryan (Stacie Mistysyn), so he wanted to relate most with Caitlin in his guest episodes for Jay and Silent Bob Go Canadian, Eh.",
    "Three relationships have begun in detention. Sean Cameron started dating Ellie Nash and Jimmy Brooks started dating Hazel Aden after sneaking onto the roof of Degrassi during detention. Liberty and J.T. began dating after kissing in detention they received for insulting Principal Raditch.",
    "Jake Epstein made the move to Broadway after wrapping up his tenure on Degrassi as troubled musician, Craig Manning. Epstein has starred in Broadway musicals such as Green Day's American Idiot, Beautiful: The Carole King Musical, and played the lead role of Peter Parker in Spider-Man: Turn Off the Dark.",
    "Sarah Barrable-Tishauer left acting altogether after her time with the show was over. She played the over achieving Liberty Van Zandt, so it is no surprise that she left to pursue a career. She is working in Canada as a DJ.",
    "Mike Lobel is the oldest student cast member in the show's history. Lobel was born in 1984 making him older than the second oldest original cast member, Daniel Clark.",
    "Dylan Michalchuk (John Bregar) was mentioned by Paige in seasons one and two as her 'older gay brother,' but he was not introduced as a character until season three.",
    "Ellie Nash was involved with every member of Craig's band, Downtown Sasquatch, at some point in time. She gave her number to Spinner, acted as Marco's girlfriend, was crushed on by Jimmy, and she kissed Craig twice. She was also Ashley's best friend.",
    "J.T Yorke was the first character to abuse prescription medication.",
    "The Ravine is notorious for being a spot students go to do bad things.",
    "Marco is the first male valedictorian to graduate from Degrassi the other is Conner. All other valedictorians have been female.",
    "Adamo Ruggiero auditioned for the role of Craig Manning, which went to Jake Epstein, but he was cast as Craig's best friend Marco Del Rossi instead.",
    "By far the most famous Degrassi alum is Aubrey Graham, aka Drake. After wrapping up his character, Jimmy Brooks, Graham went on to become a Grammy Award winning rap musician gaining worldwide fame. He has since released four albums and done collaborations with musicians such as Rihanna, Nicki Minaj, Kanye West, and Lil Wayne.",
    "In episode 6.16, Paige Michalchuk makes a comment 'Move over Antonio Bandaras (I),' a nod to Lauren Collins' movie Take the Lead (2006), in which Antonio is her dance teacher.",
    "A hot lunch at Degrassi ran anywhere from $3.99 to $4.99, plus tax.",
    "Manny is the only Filipino character to appear on Degrassi.",
    "Manny's most notable catchphrase was 'cuckoo bananas.'",
    "Marco is the only character to refer to Jimmy Brooks as 'Jim.'",
    "The climax of the feud between Degrassi and Lakehurst was the murder of J.T. Yorke. J.T. was ambushed by two rival boys outside of a house party where Lakehurst students were forcefully removed from.",
    "Danny was once babysat by Manny.",
    "Liberty, Marco, and Manny were not seen in either 'Time Stands Still' installment despite being series regulars. Even though they were not in either installment, all three characters exhibited disgust with the event in later episodes; Manny breaks up with Spinner after he confesses, Marco teams with Jimmy and Craig in alienating Spinner, and Liberty adapts Dracula into a play to help the school heal and see there is a light at the end of the tunnel.",
    "Manny and Jay's relationship began when she bribed him into pretending to be her boyfriend during her 18th birthday debut.",
    "Jimmy and Ashley have only almost had sex. In season one, Ashley decides to tell Jimmy she's ready to have sex just to try and get back at Paige but the couple ultimately decided they weren't ready. In season six, the couple once again tries to take their relationship to an intimate level but Jimmy experiences erectile dysfunction as a result of being paralyzed. Even though the couple dated through season seven, it was never revealed on if they were ever successful in having sex.",
    "Alli Bhandari appears to somewhat dislike Eli throughout the series. In real life Melinda Shankar and Munro Chambers dated.",
    "In the episode 'White Wedding', Snake's speech to his class starts off 'Love: exciting and new...' which are the lyrics to the theme song to 'The Love Boat' (1977).",
    "Connor's parents must have met at either Degrassi or Banting University as they were close enough to Mr. Simpson to name him as Connor's godfather.",
    "The first students to mock Marco for his suspected homosexuality were Spinner, Jimmy, and Sean.",
    "Degrassi Community School only had grades 7 and 8 in the first season. At the beginning of season two, Degrassi was expanded to house grades 7 through 12. The city's budget cuts were cited as reason for closing a high school and expanding Degrassi.",
    "Jake Goldsbie originally auditioned for the role of J.T. Yorke. Goldsbie was ultimately cast as J.T.'s best friend, Toby Isaacs. The role of J.T. went to 'Ryan Cooley'.",
    "The hotel where Emma meets Jordan in the series premiere is named the 'Bartley Valley' after the street in Toronto the show is filmed on.",
    "Emma Nelson said the first line of the series.",
    "Both characters named James went by nicknames. James Brooks was better known as Jimmy and James Tiberius Yorke was better known as J.T.",
    "Liberty, Emma, and Manny all attended Smithdale University.",
    "Kendra was meant to stay around long and have a subplot where she has a false pregnancy scare with Toby. She was later written out and it went to Emma.",
    "Filmed on Bartley Drive, off of Bermundsey Road, in Toronto, Ontario, Canada.",
    "Caitlin Ryan was caught by Ellie kissing her boyfriend Jesse in the main office of The Core. Caitlin was Ellie's former journalism mentor. This was the second time Jesse cheated on Ellie.",
    "Christina Schmidt was the first original cast member to leave the show after less than three full seasons. Although Schmidt left prior to the finale of season three she remained in the opening sequence.",
    "'Shout' was aired as a 90min special in the United States. The US based channel, The N, combined both installments of 'Shout' and 'How Soon is Now?' into one episode despite the last half hour taking place at the end of the school year.",
    "'When Doves Cry,' 'Tears are Not Enough,' 'Accidents Will Happen,' 'Time Stands Still,' and 'Ghost in the Machine' were not aired separately in the United States despite being two-part episodes. The US based channel, The N, aired each set as a 60min specials to keep the series runs shorter.",
    "Peter was the first character to have a secret relationships that were not due to infidelity. He was forced to keep his relationship with Emma a secret due to her best friend hating him. He was also forced to keep his relationship with Darcy a secret due to their parents not approving.",
    "Similar to Paige Michalchuk, Mr. Simpson attended Banting University.",
    "Connor was the first character to become obsessed with women's undergarments.",
    "Three actors from the Canadian television series, Radio Free Roscoe, appeared on Degrassi at some point in time. Nathan Stephenson appeared as Griffin, Kate Todd appeared as Natasha the Purple Dragon girl, and 'Al Mukadam (I)' appeared as Mohammed, the boy who made fun of Terri for being overweight.",
    "Spinner lied to everyone but Holly J about being accepted into the Police Academy. Law enforcement was listed as one of his career options in season 6, but he didn't decide to apply until season 8. His application was ultimately rejected.",
    "Jane Vaughn's real name is Anastasia Jane Valieri. She is the biological sister of Lucas Valieri, the father of Mia Jones' daughter.",
    "Emma, Manny, and Liberty have all been nude in public. Emma took her Purple Dragon dress off in front of a crowd. Manny took her dress off for Peter's video camera when intoxicated. And Liberty has streaked after getting drunk.",
    "Hazel Aden was one of two main Spirit Squad members to never become captain. The second was Anya MacPherson.",
    "Marco Del Rossi has had an episode in every season where his sexuality was a main focus.",
    "Clare Edwards' common nickname was Saint Clare.",
    "An early nickname by her friends for Clare Edwards was 'Clare Bear'.",
    "Two actors from this show have starred on CW shows. Shenae Grimes(Darcy Edwards) starred as Annie Wilson on '90210', the reboot of 90s classic 'Beverly Hills 90210', beginning in 2008. Nina Dobrev(Mia Jones) starred as Elena Gilbert on the hit show 'The Vampire Diaries' beginning in 2009.",
    "Darcy's username for her MyRoom page was 'cheergirl.'",
    "Ellie Nash (Stacey Farber) is referred to as 'Frosh' by her newspaper editor and boyfriend, Jesse Stefanovic, throughout seasons six and seven.",
    "Downtown Sasquatch and PMS are the only Degrassi bands to have more than one song. Downtown Sasquatch produced the most songs and played the most shows.",
    "Marco's obsession with Bollywood style musicals extends into season three as the school's semi-formal dance is titled, Bollywood Nights.",
    "Even though Emma Nelson's character is a year younger than Terri Mcgreggor and Ellie Nash, Miriam McDonald in reality is actually a month older than both Christina Schmidt and Stacey Farber. Miriam's birth-date is 7/26/87, Stacey b. 8/25/87, and the youngest being Christina b. 9/16/87.",
    "A majority of the wardrobe worn by Drake (Jimmy Brooks) from the second season through the end of his run on the show is Triple Five Soul.",
    "When desperate for cash, Marco has turned to gambling twice. He began playing online poker and played poker illegally with Jay's mechanic buddies while trying to fund a Spring Break trip with Spinner. He later began betting on horse races while trying to get money to go to clubbing.",
    "Daphne Hatzilakos was commonly referred to as 'Ms. Hot Sauce' by male students. The nickname stuck with her even after she became Degrassi's principal.",
    "Banting University was always referred to by Degrassi students as the 'Harvard of the North.' Paige Michalchuk was accepted into Banting and wound up dropping out before completing her first semester. Damian Hayes and Liberty Van Zandt were both accepted, but Damian was the only one to attend. Mr. Simpson and Paige's mother, Rose, were the only known Degrassi characters to complete an education at Banting.",
    "Dr. Sally gave Ellie the advice and courage to ask Marco if he liked her as anything more than friends.",
    "Despite being series regulars Miriam McDonald & Cassie Steele only appear in 2 episodes in all of Season 9.",
    "Shane Kippel (Spinner) had a crush on Lauren Collins (Paige)",
    "Daniel Clark and Drake did not get along very well during the series filming.",
    "Marco has been the focus of 3 episodes with 'heart' in the title. Ellie, KC, Peter, and Alli have also had episodes with heart in the title.",
    "Three of Liberty's crushes were ex-boyfriends of Emma. She crushed on Sean Cameron after J.T. denied her, she crushed on Chris Sharpe after he and Emma broke up, and she later targeted Damian Hayes.",
    "Manny's father, Joseph Santos, owned and operated a dry cleaning store.",
    "Students actively involved in the 'Fight For Your Right' food fight were Emma, Toby, J.T., Jimmy, Paige, Marco, and Craig. Emma was ultimately the only student to receive disciplinary action.",
    "Clare and Darcy are sisters and Clare's first appearance was on 'Eyes Without A Face(1)'",
    "When Liberty tells JT she's pregnant and he wrecks his car, Ms. Hatzilatkos runs over to their car and says 'Accidents Will Happen' a nod to the episode when Manny finds out she's pregnant.",
    "Billy Ray Cyrus: Appears as The Duke, the fugitive limo driver in 'The Power of Love.'",
    "Alanis Morissette: Appears as the school principal in 'Goin' Down the Road - Part One.'",
    "In Canada, nine episodes have viewer discretions on them: 'Time Stands Still' (part 2) for a school shooting, 'Shout' (parts 1 and 2) for rape, 'Secret' (parts 1 and 2) for oral sex and gonorrhea, 'Don't You Want Me' (parts 1 and 2) for stripping, and 'Jane Says' (parts 1 and 2) for child molestation. However, in the United States, only 'Shout' came with a viewer discretion warning.",
    "As of Season 15, Stefen Brogren is the only main member of the original cast to still be on the show.",
    "Four characters have made attempts to kill themselves during the show. Ellie almost drowned herself (she can't swim) in 'Degrassi Goes Hollywood' but is saved by Craig. Craig himself jumps in front of a train in season 2 but is saved by Sean. J.T. Yorke overdoses on drugs due to his stress of losing Liberty, his job, Toby, and his family. He is rushed to the hospital on time though. Darcy slits her wrist in season 7 after she was raped but is found in time by Manny in the showers.",
    "As of 2014 there have been seven deaths: Craig's dad (car wreck), Rick (school shooting), J.T. Yorke (murdered by Lakehurst thug), Anson (murdered by Bianca), Campbell Saunders (suicide), Paula (cancer), and Adam Torres (car wreck from texting and driving).",
    "Mia Jones was the youngest teen mother in Degrassi history. She got pregnant with and gave birth to her daughter, Isabella, at age 13.",
    "Two sets of characters got married throughout the show's run. The first couple was Snake and Spike (Mr. Simpson and Christine Nelson) and the second couple was Emma and Spinner.",
    "Darcy was not the first rape victim at Degrassi, but she was the first to attempt suicide as a result.",
    "Six characters at Degrassi have had sexually transmitted diseases. Jay, Alex, Emma, and Amy all had gonorrhea, Johnny was a carrier for HPV, and Darcy contracted chlamydia from her rapist.",
    "Spinner won every fight he engaged in with Johnny DiMarco.",
    "All of Spinner Mason's girlfriends have been taken advantage of sexually in some way. Paige was raped by Dean at a house party, Manny was filmed topless by Peter while drunk at a party, Darcy was roofied and date raped at a ski resort, Jane was molested by her father, and Emma was stalked and nearly molested by an internet predator.",
    "Jimmy and Hazel had the second longest lasting relationship at Degrassi.",
    "As of 2012 there are five characters who have done harm to themselves. They are: Emma, Ellie, Darcy, Adam, and Cam.",
    "Jimmy caught his father cheating with another woman, but he wasn't the first character to witness parental infidelity. Emma caught Mr. Simpson making out with Principal Hatzilakos in a movie theater.",
    "Damian and Manny had the shortest relationship in Degrassi history as it lasted less than 45 minutes.",
    "Terri went missing after season three with a mention she went to private school. She reappears at the reunion but doesn't speak.",
    "Peter Stone has chronic Halitosis, aka. bad breath. He was publicly humiliated by Jane in class because of it.",
    "Both Claire and Darcy Edwards lost their virginity junior year.",
    "In Damian's short time at Degrassi he was romantically involved with three girls.",
    "As of the current season of Degrassi, Cam Sauders is the only one who has committed suicide",
    "Degrassi's first break-up was Jimmy and Ashley in season one.",
    "Jane and Mia were best friends before Mia was impregnated by Jane's brother, Lucas.",
    "Even though Emma and Liberty graduated from Degrassi as friends they did struggle with their friendship since grade seven. Emma unintentionally starts a rumor that Liberty was being molested by Coach Armstrong, Liberty blames favoritism as a reason why she lost the science fair to Emma's 'Mind-Body Connection' project, Emma gets jealous when Liberty begins crushing on Chris Sharpe, Liberty's ex-boyfriend J.T. was murdered at a party thrown at Emma's house, and Liberty kisses Emma's boyfriend Damian at senior prom.",
    "Degrassi Community School's main rivals include Bardell and Lakehurst. Paige's rapist, Dean, was a student at Bardell while the group of students that murdered J.T. were from Lakehurst.",
    "Pat Mastroianni (Joey Jeremiah) suddenly left the show after season five. It was revealed halfway through season six that Joey was selling his home and moving to Calgary.",
    "Both of Jane's relationships were boys Holly J crushed on or dated at one point in time.",
    "Damian Hayes was the only regular character to not pass 10 episodes. He also was not featured or mentioned after the finale of season seven.",
    "Kendra Mason was the first adopted character. Derek Haig followed suit and revealed he was adopted to Liberty in season five.",
    "Lucas Valieri dropped out of Degrassi during his senior year.",
    "There have been two physical abuse story lines in the show, specifically relating to abusive fathers. Both Craig (season 2) and Miles (season 14) have had an abusive story line.",
    "Derek Haig was the only season eight regular to not appear in season nine.",
    "Miriam Macdonalds (Emma) first kiss was with Daniel Clark (Sean)"
]
